## This Notebook shows different types of merge and concat of dataframes

In [3]:
import pandas as pd

In [16]:
df1 = pd.DataFrame({
    'id' :[1,2,3,4,5],
    'name':['tosif','ayan','sajid','aliyanz','himanshu']
})
df1.set_index('id',drop=True,inplace = True)

In [17]:
df2 = pd.DataFrame({
    'id' :[1,2,3,4,5,6],
    'name':['tosif','ayan','bhura','aliyanz','himanshu','saif']
})
df2.set_index('id',drop=True,inplace = True)

In [24]:
df1.merge(df2,how='right')

       name
0     tosif
1      ayan
2     bhura
3   aliyanz
4  himanshu
5      saif